patrykSilkowski/nRF52_mash/app/main.c
/*
    MQTT-SN pub/sub example on nRF52840 Thread - adapted from Nordic SDK
    examples.

    Buttons/LEDS as input/output devices (buttons are treated as switches)
    protocol usage presented in ../tools/protocol.odt
 */

/* GCC */
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

/* SDK */
#include "app_scheduler.h"
#include "app_timer.h"
#include "bsp_thread.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "thread_utils.h"

#include <openthread/thread.h>
#include <openthread/joiner.h>

/* APP */
#include "comm_manager.h"
#include "comm_utils.h"
#include "service_bsp.h"
#include "service_setup.h"
#include "service_config.h"


#define VENDOR_NAME   "SIGMA_PS"
#define VENDOR_MODEL  "1"
#define VENDOR_SW_VER "0.0.1"
#define VENDOR_DATA   NULL
#define JOINER_PSKD   "J01NME"


#define DEFAULT_CHILD_TIMEOUT  40                                           /**< Thread child timeout [s]. */
#define DEFAULT_POLL_PERIOD    1000                                         /**< Thread Sleepy End Device polling period when MQTT-SN Asleep. [ms] */
#define NUM_SLAAC_ADDRESSES    4                                            /**< Number of SLAAC addresses. */
#define OT_JOIN_TRIES          20                                           /**< Amount of attempts to connect to the OT network */


#define SCHED_QUEUE_SIZE       8                                            /**< Maximum number of events in the scheduler queue. */
#define SCHED_EVENT_DATA_SIZE  sizeof(mqttsn_event_t)                       /**< Maximum app_scheduler event size. */

#define APP_TIM_JOINER_DELAY 200
#define APP_TIMER_TICKS_TIMEOUT APP_TIMER_TICKS(50)

static otNetifAddress m_slaac_addresses[NUM_SLAAC_ADDRESSES];               /**< Buffer containing addresses resolved by SLAAC */

static bool g_led_2_on = false;

static char m_str_eui[17];                                                  /**< EUI64 of the device. */

static uint8_t m_ot_join_tries = OT_JOIN_TRIES;                             /**< Down-counter of OT network searching attempts */
static otDeviceRole m_ot_prev_role = OT_DEVICE_ROLE_DISABLED;               /**< Store device's OT network role */

/***************************************************************************************************
 * @section scheduler prototypes
 **************************************************************************************************/

static void sched_joiner(void * p_event_data, uint16_t event_size);
static void sched_print_ip(void * p_event_data, uint16_t event_size);
static void sched_mqttsn_gw_search(void * p_event_data, uint16_t event_size);
static void sched_mqttsn_gw_connect(void * p_event_data, uint16_t event_size);
static void sched_ot_recommissioning(void * p_event_data, uint16_t event_size);
static void sched_start_services(void * p_event_data, uint16_t event_size);
static void sched_registed_service(void * p_event_data, uint16_t event_size);
static void sched_subscribed_service(void * p_event_data, uint16_t event_size);
static void sched_timeout_handler(void * p_event_data, uint16_t event_size);
static void sched_receive_msg_handler(void * p_event_data, uint16_t event_size);

/***************************************************************************************************
 * @section app prototypes
 **************************************************************************************************/
static void joiner_start(void * p_context);
static void print_ip_info(void);


/***************************************************************************************************
 * @section OpenThread
 **************************************************************************************************/


/**@brief Function for indicating Thread state change.
 */
static void thread_state_changed_callback(uint32_t flags, void * p_context)
{
    otDeviceRole ot_pres_role = otThreadGetDeviceRole(p_context);

    NRF_LOG_INFO("State changed! Flags: 0x%08x Current role: %d\r\n",
                 flags, ot_pres_role);

    if (flags & OT_CHANGED_THREAD_NETDATA)
    {
        /**
         * Whenever Thread Network Data is changed, it is necessary to check if generation of global
         * addresses is needed. This operation is performed internally by the OpenThread CLI module.
         * To lower power consumption, the examples that implement Thread Sleepy End Device role
         * don't use the OpenThread CLI module. Therefore otIp6SlaacUpdate util is used to create
         * IPv6 addresses.
         */
         otIp6SlaacUpdate(thread_ot_instance_get(), m_slaac_addresses,
                          sizeof(m_slaac_addresses) / sizeof(m_slaac_addresses[0]),
                          otIp6CreateRandomIid, NULL);
    }

    if (   m_ot_prev_role == OT_DEVICE_ROLE_DETACHED
        &&   ot_pres_role >= OT_DEVICE_ROLE_CHILD   )
    {
        /**
         * If the device has just commissioned and successfully connected to the
         * Thread Network, start to search MQTT-SN gateway
         */
        uint32_t err_code = app_sched_event_put(NULL,
                                                0,
                                                sched_mqttsn_gw_search);
        APP_ERROR_CHECK(err_code);
    }

    // Store the device role
    m_ot_prev_role = ot_pres_role;
}


/**@brief Function for initializing the Thread Stack.
 */
static void thread_instance_init(void)
{
    thread_configuration_t thread_configuration =
    {
        .role                  = RX_ON_WHEN_IDLE,
        .autocommissioning     = false,
        .poll_period           = DEFAULT_POLL_PERIOD,
        .default_child_timeout = DEFAULT_CHILD_TIMEOUT,
    };

    thread_init(&thread_configuration);
    //thread_cli_init();  // DONT NEED THIS ANYMORE ->
    thread_state_changed_callback_set(thread_state_changed_callback);
}


/**@brief Function for formating IPv6 from typedef to string.
 */
static void format_ip6(char *str, const otIp6Address* addr)
{
    if(addr)
    {
        sprintf(str,"%x:%x:%x:%x:%x:%x:%x:%x",
                addr->mFields.m16[0],
                addr->mFields.m16[1],
                addr->mFields.m16[2],
                addr->mFields.m16[3],
                addr->mFields.m16[4],
                addr->mFields.m16[5],
                addr->mFields.m16[6],
                addr->mFields.m16[7]);
    }
    else
    {
        sprintf(str,"NULL");
    }
}

/**@brief Function for printing device commission data
 * (eui64 and QRcode to generate pattern)
 */
static void print_commissioning_info(void)
{
    otExtAddress eui64;

    otLinkGetFactoryAssignedIeeeEui64(thread_ot_instance_get(), &eui64);

    NRF_LOG_PROCESS();
    NRF_LOG_FLUSH();

    sprintf(m_str_eui,"%x%x%x%x%x%x%x%x",
            eui64.m8[0],
            eui64.m8[1],
            eui64.m8[2],
            eui64.m8[3],
            eui64.m8[4],
            eui64.m8[5],
            eui64.m8[6],
            eui64.m8[7]);

    NRF_LOG_INFO("\r\nEUI64:%s",m_str_eui);
    NRF_LOG_INFO("QRCODE: v=1&&eui=%s&&cc=%s", m_str_eui, JOINER_PSKD);
    NRF_LOG_INFO("sudo wpanctl commissioner -a %s %s\r\n", JOINER_PSKD, m_str_eui);
    NRF_LOG_PROCESS();
}

/**@brief Function for printing IP information via NRF_LOG(RTT).
 */
static void print_ip_info(void)
{
    char buff[128];
    const otNetifMulticastAddress *mulAddress
        = otIp6GetMulticastAddresses(thread_ot_instance_get());

    //otNetifMulticastAddress **_mulAddr = &mulAddress;
    //otNetifAddress uniAddress = otIp6GetUnicastAdresses(thread_ot_instance_get());
    if(mulAddress)
    {
        for(; mulAddress/*->mNext*/; mulAddress = mulAddress->mNext)
        {
            format_ip6(buff,&(mulAddress->mAddress));
            NRF_LOG_INFO("Multicast Address: %s", nrf_log_push(buff));
            NRF_LOG_PROCESS();
        }
    }

