patrykSilkowski/nRF52_mash/app/main.c
    switch (event)
    {
        case BSP_EVENT_KEY_1:
        {
            // reset LED state
            LEDS_OFF(BSP_LED_2_MASK);
            g_led_2_on = false;

        }
        break;

        case BSP_EVENT_KEY_2:
        {
            // uint32_t err_code;
            /*
            if (mqttsn_client_state_get(&m_client) == MQTTSN_CLIENT_CONNECTED)
            {
                err_code = mqttsn_client_disconnect(&m_client);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_ERROR("DISCONNECT message could not be sent. Error: 0x%x\r\n", err_code);
                }
                else
                {
                    //LEDS_OFF(BSP_LED_3_MASK);
                    g_led_3_on = false;
                    NRF_LOG_INFO("DISCONNECT MQTT-SN CLIENT message sent.");
                }
            }
            else
            {
                err_code = mqttsn_client_connect(&m_client, &m_gateway_addr, m_gateway_id, &m_connect_opt);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_ERROR("CONNECT message could not be sent. Error: 0x%x\r\n", err_code);
                }
                else
                {
                    //LEDS_ON(BSP_LED_3_MASK);
                    g_led_3_on = true;
                    NRF_LOG_INFO("CONNECT MQTT-SN CLIENT message sent.");
                }
            }
            */
        }
        break;

        case BSP_EVENT_KEY_3:
        {
            publish();
        }
        break;

        default:
        break;
    } // end of switch
}

/***************************************************************************************************
 * @section Initialization
 **************************************************************************************************/

/**@brief Function for initializing the Application Timer Module.
 */
static void timer_init(void)
{
    uint32_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the LEDs.
 */
static void leds_init(void)
{
    LEDS_CONFIGURE(LEDS_MASK);
    LEDS_OFF(LEDS_MASK);
}


/**@brief Function for initializing the buttons and their event handler.
 */
static void buttons_bsp_init(void)
{
    uint32_t err_code;
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing scheduler module.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


static void sched_joiner(void * p_event_data, uint16_t event_size)
{
    joiner_start(NULL);
}

static void sched_print_ip(void * p_event_data, uint16_t event_size)
{
    print_ip_info();
}

static void sched_mqttsn_gw_search(void * p_event_data, uint16_t event_size)
{
    comm_manager_search_gateway();
}

static void sched_mqttsn_gw_connect(void * p_event_data, uint16_t event_size)
{
    comm_manager_connect_to_gateway();
}

static void sched_ot_recommissioning(void * p_event_data, uint16_t event_size)
{
    thread_detach_and_commission();
}

static void sched_start_services(void * p_event_data, uint16_t event_size)
{
    int8_t err_code = create_self_services_init();

    if (err_code)
    {
        NRF_LOG_ERROR("Service: creator initialize error: %d\r\n", err_code);
    }
}

static void sched_registed_service(void * p_event_data, uint16_t event_size)
{
    NRF_LOG_DEBUG("actual void pointer %p", p_event_data);

    mqttsn_event_t * p_evt = (mqttsn_event_t *) p_event_data;

    int8_t err_code = service_subscribe_to_registered(
        p_evt->event_data.registered.packet.id,
        p_evt->event_data.registered.packet.topic.topic_id);

    if (err_code)
    {
        NRF_LOG_DEBUG("actual pointer %p", p_evt);
        NRF_LOG_ERROR("Service: subscription to registered topic error: %d\r\n",
                      err_code);
    }
}

static void sched_subscribed_service(void * p_event_data, uint16_t event_size)
{
    mqttsn_event_t * p_evt = (mqttsn_event_t *) p_event_data;

    int8_t err_code;

    if (p_evt->event_data.registered.packet.topic.topic_id
                                                    > SERVICE_SELF_TOPIC_ID_MAX)
    {
        // handling the subscription for external topic
        err_code = service_config_add_ext_topic(
                    p_evt->event_data.registered.packet.topic.topic_id,
                    p_evt->event_data.registered.packet.id);
    }
    else
    {
        // handling self subscription
        err_code = service_insert_to_database(
                    p_evt->event_data.registered.packet.id,
                    p_evt->event_data.registered.packet.topic.topic_id);
    }

    if (err_code)
    {
        NRF_LOG_ERROR("Service: subscription of topic with ID:%d returned with error: %d\r\n",
                      p_evt->event_data.registered.packet.topic.topic_id,
                      err_code);
        //TODO think about handling such error
        // -> give up and try to register next one
        // -> retry to register this one
    }
    else
    {
        NRF_LOG_INFO("Service: function with ID:%d successfully added.\r\n",
                     p_evt->event_data.registered.packet.topic.topic_id);
    }

    err_code = create_self_services_continue();

    if (SERVICE_ALL_REGISTERED_FLAG == err_code)
    {
        NRF_LOG_INFO("Service: all self functions has been added.\r\n",
                     p_evt->event_data.registered.packet.topic.topic_id);
    }
}


static void sched_timeout_handler(void * p_event_data, uint16_t event_size)
{
    mqttsn_event_t * p_evt = (mqttsn_event_t *) p_event_data;

    switch(p_evt->event_data.error.error)
    {
        case MQTTSN_ERROR_REJECTED_CONGESTION:
            NRF_LOG_ERROR("Message has been rejected due to network congestion!");
        break;

        case MQTTSN_ERROR_TIMEOUT:
            NRF_LOG_ERROR("Retransmission limit has been reached!");
        break;

    } // end of switch (error)

    int8_t err_code = 0;

    switch(p_evt->event_data.error.msg_type)
    {
        case MQTTSN_PACKET_CONNACK:
            NRF_LOG_ERROR("CONNACK message has not been received!");
        break;

        case MQTTSN_PACKET_REGACK:
            NRF_LOG_ERROR("REGACK message has not been received!");

            err_code = service_retry_register(p_evt->event_data.error.msg_id);
        break;

