patrykSilkowski/nRF52_mash/app/main.c
        case MQTTSN_PACKET_PUBACK:
            NRF_LOG_ERROR("PUBACK message has not been received!");
        break;

        case MQTTSN_PACKET_SUBACK:
            NRF_LOG_ERROR("SUBACK message has not been received!");

            err_code = service_retry_subscribe(p_evt->event_data.error.msg_id);
        break;

        case MQTTSN_PACKET_UNSUBACK:
            NRF_LOG_ERROR("UNSUBACK message has not been received!");
        break;

        case MQTTSN_PACKET_PINGREQ:
            NRF_LOG_ERROR("PINGREQ message has not been received!");
        break;

        case MQTTSN_PACKET_WILLTOPICUPD:
            NRF_LOG_ERROR("WILLTOPICUPD message has not been received!");
        break;

        case MQTTSN_PACKET_WILLMSGUPD:
            NRF_LOG_ERROR("WILLMSGUPD message has not been received!");
        break;

        default:
        case MQTTSN_PACKET_INCORRECT:
            NRF_LOG_ERROR("Unknown error!");
        break;
    } // end of switch (msg_type)

    //log error because the timeout is an error itself
    NRF_LOG_ERROR("Timeout handling returned with error %d", err_code);

    if (SERVICE_RETRY_CNT_MAX_FLAG == err_code)
    {
        // TODO this should be reconsidered!
        comm_manager_disconnect_from_gateway();
        comm_manager_search_gateway();
    }
}

static void sched_receive_msg_handler(void * p_event_data, uint16_t event_size)
{
    mqttsn_event_t * p_evt = (mqttsn_event_t *) p_event_data;
    service_data_t * p_service = NULL;

    if (p_evt->event_data.registered.packet.topic.topic_id
                                                    > SERVICE_SELF_TOPIC_ID_MAX)
    {
        //TODO add ext_sub_topic_t handling!
    }
    else
    {
        p_service = service_pop_with_topic_id(
                            p_evt->event_data.published.packet.topic.topic_id);
    }

    if (NULL == p_service)
    {
        NRF_LOG_ERROR("Service: no such service (topic) with ID %d",
                      p_evt->event_data.published.packet.topic.topic_id);
       return;
    }

    int8_t err_code = -1;

    switch (p_service->type)
    {
        // not all types are handled
        case info:
            //parse msg INFO
        break;

        case onoff:
            //parse msg AND handle ext subscription
        break;

        case config_sub:
            err_code = service_config_subscribe(p_service->endpoint,
                                    p_evt->event_data.published.packet.p_data,
                                    p_evt->event_data.published.packet.len);
        break;

        case config_unsub:

        break;

        case config_list:

        break;

        case type_none:
        default:
            NRF_LOG_ERROR("Service: no such service");
        break;
    } // end of switch by service->type

    if (err_code)
    {
        NRF_LOG_ERROR("Receiving handler of service %d returned with error %d",
        p_service->type,
        err_code);
    }

}

/***************************************************************************************************
 * @section Main
 **************************************************************************************************/

int main(int argc, char *argv[])
{
    log_init();
    scheduler_init();
    timer_init();
    leds_init();
    buttons_bsp_init();

/*
 *  mash_id_gen();
    NRF_LOG_INFO("ID:%s",mash_get_id());
 */

    thread_instance_init();
    //init_joiner_timer();
    commission_check();
    mqttsn_init();
    //start_joiner_timer();

    while (true)
    {
        thread_process();
        app_sched_execute();

        if (NRF_LOG_PROCESS() == false)
        {
            thread_sleep();
        }
    }
}

/**
 *@}
 **/
